{
  "config": {
    "error": "انواع خطاها"
  },
  "/": {
    "name": "خانه",
    "title": "مستندات api شیمی کده ی الن",
    "text": "در اینجا شما میتوانید اطلاعات جدیدی در مورد api شیمی کده ی مجازی الن کسب کنید.\nاین api شامل مواردی برای بدست آوردن تمام اتم ها، بدست آوردن اطلاعات اتم به صورت جداگانه، ترجمه و جستجو در بین آنهاست.\nمستندات به صورت ساده و روان نوشته شده اند تا هر کس به راحتی بتواند از آنها استفاده کند، همچنین در تمام زبان های برنامه نویسی شما میتوانید ازاین api استفاده کنید اما بدانید فعلا ما هیچ گونه کتابخانه ای جهت استفاده در زبان برنامه نویسی خاصی ایجاد نکرده ایم. \nاستفاده از این api رایگان است همچنین شما میتوانید در توسعه ی این پروژه مشارکت کنید."
  },
  "init/": {
    "name": "آماده سازی",
    "title": "آماده سازی برای شروع",
    "text": "لازم است که این پروژه را از طریق گیت‌هاب در رایانه ی شخصیه خود clone کنید و سپس الزامات را نصب کرده و با انجام دستور yarn start در هر دو پوشه ی root (/) و client سایت را در سیستمان اجرا کنید.\nحالا مراحل بعدی را انجام دهید."
  },
  "get/all": {
    "name": "بدست آوردن تمام اتم ها",
    "title": "بدست آوردن تمام اتم ها",
    "text": "برای بدست آوردن تمام اتم ها لازم است تا یه درخواست از نوع GET به آدرس بالا ارسال کنید سپس شما اطلاعات زیر را دریافت میکنید."
  },
  "get/single": {
    "name": "بدست آوردن اتم خاص",
    "title": "بدست آوردن اطلاعات یک اتم خاص",
    "text": "برای بدست آوردن اطلاعات یک اتم خاص فقط لازمه که نام اون رو وارد کنید اون وقت شما یه لیست از بیشتر اطلاعات به دست می آورید.\n در بعضی از اتم ها که قبلا بازدید شده اند ترجمه فارسی اطلاعات موجود است اما در بعضی دیگر این شی وجود ندارد و اگر میخواهید آنها را ترجمه کنید باید طبق api اقدام کنید."
  },
  "get/single-translate": {
    "name": "ترجمه ی یک اتم",
    "title": "ترجمه ی اطلاعات اتم",
    "text": "ترجمه ی اطلاعات یک اتم خاص به وسیله ی کد آن زبان موجود است؛ دلیلش هم استفاده از api گوگل ترنسلیت هست که به راحتی ترجمه میکنه.\nالبته که اسم اتم ها چون به وسیله ی گوگل ترنسلیت به خوبی ترجمه نمی شود و همچنین ما به سورس ویکی پدیا هم احتیاج داریم برای ترجمه ی اسم از api ویکی پدیا استفاده کردیم تا نتیجه ی بهتری بدست بی آید.\nترجمه به زبان فارسی در دیتابیس ذخیره می شود و برای بار بعدی سرعت عملیات بالا می‌رود اما برای بقیه ی موارد شما باید در هر دور مدتی صبر کنید.\nترجمه طولانی ترین بخش این api است چون زمان خیلی زیادی برای این کار صرف میشود تا نتیجه ی خوبی بدست آید؛\nچون زبان فارسی ذخیره می‌شود و در بعضی شرایط شاید ترجمه آپدیت یا عوض شود ما یک ?refresh=true هم قرار داده ایم تا بتوانید ترجمه ی ذخیره شده را آپدیت کنید.\nدر صورتی که ترجمه با موفقیت انجام شود شما در کنسول پیامی به منظور translated to ... می‌بینید"
  },
  "post/search": {
    "name": "جستجو",
    "title": "اتم (های) مورد نظر خود را پیدا کنید",
    "text": "برای جستجو شما باید یک در خواست از نوع POST شامل یک q که میتواند رشته یا عدد باشد به آدرس بالا ارسال کنید سپس اطلاعات زیر را بنا بر درخواست‌ تان دریافت میکنید،\nشما میتوانید به زبان انگلیسی و فارسی مقادیر نام، دسته، فاز، نشان، کاشف/زمان کشف، دمای جوش/ذوب، چگالی و عدد جرمی/اتمی را جستجو کنید اما از میان این مقادیر فقط امکان جستجو نام، کاشف/زمان کشف، دسته و فاز به صورت فارسی در دسترسی میباشد و بقیه ی مقادیر را باید به صورت انگلیسی وارد کنید.\nالبته که جستجو با پارامتر های فارسی به هیچ عنوان دقیق نیست زیرا ممکن اتمی با مشخصه ی مورد نظر شما ترجمه نشده باشد.\nشما میتوانید با limit تعداد دریافت ها را محدود کنید."
  }
}
